app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2016-11-09 04:26:35', '2016-11-09 04:26:35')

  def destroy
    @cart.destroy if @cart.id == session[:cart_id]
---
DELETE FROM `carts` WHERE `carts`.`id` = 1