app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    # @line_item = @cart.line_items.build(product: product)
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2016-11-09 04:26:20', '2016-11-09 04:26:20')
INSERT INTO `line_items` (`product_id`, `cart_id`, `created_at`, `updated_at`) VALUES (3, 1, '2016-11-09 04:26:20', '2016-11-09 04:26:20')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2016-11-09 06:18:15' WHERE `line_items`.`id` = 7